---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveElemLineAngle
source: html/82c9eb04-fcec-e129-ffd0-ffed9b6a1650.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveElemLineAngle Property

"Angle"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveElemLineAngle { get; }
```